CFDSimulationOfFlowInAnElbowUsingOpenFoam/Water/V=1.95_P=3.3atm/case1_6C_0-700_WI5/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.014259;

boundaryField
{

    Inlet
    {
        type            fixedValue;
        value           uniform 0.014259;
    }
    
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.014259;
    }

    Wall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
